; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph5 - mode
	image1 - mode
	spectrograph8 - mode
	image2 - mode
	image0 - mode
	thermograph6 - mode
	thermograph7 - mode
	thermograph3 - mode
	thermograph4 - mode
	Star5 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star0 - direction
	Star4 - direction
	GroundStation2 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 thermograph6)
	(supports instrument0 image1)
	(supports instrument0 spectrograph5)
	(supports instrument0 thermograph4)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image1)
	(supports instrument1 thermograph3)
	(supports instrument1 spectrograph8)
	(calibration_target instrument1 Star0)
	(supports instrument2 thermograph7)
	(supports instrument2 thermograph6)
	(supports instrument2 spectrograph5)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
)
(:goal (and
	(pointing satellite0 Phenomenon9)
	(have_image Star6 thermograph7)
	(have_image Star6 thermograph6)
	(have_image Phenomenon7 thermograph6)
	(have_image Planet8 image2)
	(have_image Phenomenon9 image0)
	(have_image Planet10 thermograph6)
	(have_image Planet10 thermograph7)
	(have_image Planet10 thermograph4)
	(have_image Phenomenon11 spectrograph8)
	(have_image Star12 image0)
))

)

; plan
1. (turn_to satellite0 groundstation1 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 11
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 11
3. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 11
4. (turn_to satellite0 planet8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet8)
   goals met: 0 of 11
5. (take_image satellite0 planet8 instrument0 image2)
   added: (have_image planet8 image2)
   goals met: 1 of 11
6. (turn_to satellite0 planet10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet10)
   goals met: 1 of 11
7. (take_image satellite0 planet10 instrument0 thermograph4)
   added: (have_image planet10 thermograph4)
   goals met: 2 of 11
8. (turn_to satellite0 phenomenon7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 11
9. (take_image satellite0 phenomenon7 instrument0 thermograph6)
   added: (have_image phenomenon7 thermograph6)
   goals met: 3 of 11
10. (turn_to satellite0 star0 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star0)
   goals met: 3 of 11
11. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 11
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 11
13. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 3 of 11
14. (turn_to satellite0 phenomenon11 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 11
15. (take_image satellite0 phenomenon11 instrument1 spectrograph8)
   added: (have_image phenomenon11 spectrograph8)
   goals met: 4 of 11
16. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 11
17. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 4 of 11
18. (turn_to satellite0 groundstation2 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 groundstation2)
   goals met: 4 of 11
19. (calibrate satellite0 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 4 of 11
20. (turn_to satellite0 planet10 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet10)
   goals met: 4 of 11
21. (take_image satellite0 planet10 instrument2 thermograph6)
   added: (have_image planet10 thermograph6)
   goals met: 5 of 11
22. (take_image satellite0 planet10 instrument2 thermograph7)
   added: (have_image planet10 thermograph7)
   goals met: 6 of 11
23. (turn_to satellite0 star12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star12)
   goals met: 6 of 11
24. (take_image satellite0 star12 instrument2 image0)
   added: (have_image star12 image0)
   goals met: 7 of 11
25. (turn_to satellite0 star6 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star6)
   goals met: 7 of 11
26. (take_image satellite0 star6 instrument2 thermograph6)
   added: (have_image star6 thermograph6)
   goals met: 8 of 11
27. (take_image satellite0 star6 instrument2 thermograph7)
   added: (have_image star6 thermograph7)
   goals met: 9 of 11
28. (turn_to satellite0 phenomenon9 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon9)
   goals met: 10 of 11
29. (take_image satellite0 phenomenon9 instrument2 image0)
   added: (have_image phenomenon9 image0)
   goals met: 11 of 11
